Roufertos/Dent-Boards/boards.txt
# Copyright (c) 2014-2017 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA


# Arduino Farmer 42
# --------------------
frmr42.name=Farmer 42
frmr42.vid.0=0x2341
frmr42.pid.0=0x8055
frmr42.vid.1=0x2341
frmr42.pid.1=0x0055

frmr42.upload.tool=bossac
frmr42.upload.protocol=sam-ba
frmr42.upload.maximum_size=262144
frmr42.upload.maximum_data_size=32768
frmr42.upload.use_1200bps_touch=true
frmr42.upload.wait_for_upload_port=true
frmr42.upload.native_usb=true
frmr42.build.mcu=cortex-m0plus
frmr42.build.f_cpu=48000000L
frmr42.build.usb_product="Arduino MKR NB 1500"
frmr42.build.usb_manufacturer="Arduino LLC"
frmr42.build.board=SAMD_MKRNB1500
frmr42.build.core=arduino
frmr42.build.extra_flags=-DUSE_ARDUINO_MKR_PIN_LAYOUT -D__SAMD21G18A__ {build.usb_flags} -DUSE_BQ24195L_PMIC
frmr42.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
frmr42.build.openocdscript=openocd_scripts/arduino_zero.cfg
frmr42.build.variant=frmr42
frmr42.build.vid=0x2341
frmr42.build.pid=0x8055
frmr42.bootloader.tool=openocd
frmr42.bootloader.file=mkrnb1500/samd21_sam_ba_arduino_mkrnb1500.bin


